/*==========================================================================================
ヘッダファイル説明:
	ミノの移動、ステージとミノの当たり判定、及び判定後ミノ位置の調整
==========================================================================================*/
#ifndef COLLISION_H_
#define COLLISION_H_

/*==========================================================================================
	インクルードヘッダ
==========================================================================================*/
#include "Stage.h"
#include "Mino.h"
#include "Score.h"

/*==========================================================================================
	クラス定義
==========================================================================================*/
class Collision
{
public:
	static int MoveMinoPosAfterRot(const Stage*, Mino*);					//回転後ミノの位置調整
	static int CollisionStageAndMino(const Stage*, const Mino*);			//ミノとステージの当たり判定

private:
	static int MoveMinoPosAfterRotElement3(const Stage*, Mino*);			//回転後3x3のミノの位置調整
	static int MoveMinoPosAfterRotI_Mino(const Stage*, Mino*);				//回転後Iミノの位置調整
};

#endif