/*==========================================================================================
ヘッダファイル説明:
	ゲーム内データのやり取りを司るクラスのヘッダ
==========================================================================================*/
#ifndef DATA_EXCHANGE_H_
#define DATA_EXCHANGE_H_

/*==========================================================================================
	インクルードヘッダ
==========================================================================================*/
#include "Mino.h"
#include "Stage.h"

/*==========================================================================================
	クラス定義
==========================================================================================*/
class DataExchange 
{
public:
	static int WriteDataInMino(Mino* pOut, const Mino* pIn);				//pInミノのデータをpOutミノに書き込む
	static int WriteMinoDataInStage(Stage* pStage, const Mino* pMino);		//ミノのデータをステージに書き込む
};

#endif