/*==========================================================================================
ヘッダファイル説明:
	置き場所を教えるためのガイドのクラス
==========================================================================================*/
#ifndef GHOST_H_
#define GHOST_H_

/*==========================================================================================
	インクルードヘッダ
==========================================================================================*/
#include "Stage.h"
#include "Mino.h"

/*==========================================================================================
	クラス定義
==========================================================================================*/
class Ghost
{
public:
	Ghost();
	~Ghost();

	bool Init(void);			//初期化処理
	void CalcPosInMap(const Stage*,const Mino*);		//マップ上の位置計算
	void Draw(const Vector2& MapPos);		//描画処理
	void Uninit(void);

	Vector2 GetPosInMap(void) const { return m_PosInMap; }
private:
	Vector2		m_PosInMap;										//マップ上の位置
	int			m_Matrix[MINO_MATRIX_SIZE][MINO_MATRIX_SIZE];	//ゴーストの行列
	int			m_GraphHandle[MINO_TEX_MAX];					//グラフィックハンドル
};
#endif