#ifndef SCENE_RANKING_H_
#define SCENE_RANKING_H_

/*==========================================================================================
インクルードヘッダ
==========================================================================================*/
#include "SceneBase.h"

/*==========================================================================================
	マクロ
==========================================================================================*/
#define RANKING_NUM (5)

/*==========================================================================================
	クラス定義
==========================================================================================*/
class SceneRanking : public SceneBase
{
public:
	SceneRanking();
	~SceneRanking();

	virtual bool Init(void);		//初期化処理
	virtual void Update(void);		//更新処理
	virtual void Draw(void);		//描画処理
	virtual void Uninit(void);		//終了処理

private:
	unsigned int m_RankingScore[RANKING_NUM];
};

#endif