/*==========================================================================================
ヘッダファイル説明:
	ゲームの中のスコアクラス
==========================================================================================*/
#ifndef SCORE_H_
#define SCORE_H_

/*==========================================================================================
	インクルードヘッダ
==========================================================================================*/
#include "Common.h"

/*==========================================================================================
	マクロ
==========================================================================================*/
#define SCORE_TEX_MAX (10)		//スコアのテクスチャ数
#define KILL_ONE_LINE (200)		//1ラインを消す時の点数
#define KILL_TWO_LINE (800)		//2ラインを消す時の点数
#define KILL_THREE_LINE (1800)	//3ラインを消す時の点数
#define KILL_FOUR_LINE (2500)	//4ラインを消す時の点数

/*==========================================================================================
	クラス定義
==========================================================================================*/
class Score 
{
public:
	Score();
	~Score();

	bool Init(void);	//初期化処理
	void Draw(void);	//描画処理
	void Uninit(void);	//終了処理

	void SetPos(const Vector2& pos) { m_DrawPos = pos; }		//描画位置を設定
	int GetScore(void) const { return m_Score; }				//スコア
	void AddScore(unsigned int Score) { m_Score += Score; }		//スコア加算
private:
	Vector2 m_DrawPos;				//描画位置
	unsigned int m_Score;			//スコア
	int	m_GraphHandle[SCORE_TEX_MAX];	//グラフィックハンドル
};

#endif